from matplotlib import gridspec
import matplotlib.pyplot as plt

zc = ["工艺美术师","高级会计师","思政讲师","副研究馆员","高级工艺美术师","高级教师","副研究员","研究实习员","研究馆员（档案）","助理编辑","总工程师","医士","技师","技术员","未评级","副主任工程","助馆","助理政工师","研究员级高级工程师","教授级高级工程师","高级工","副教授","总经理","主任医师","研究员（自然科学）","护师","馆员","主任编辑","统计师","高级讲师","小学高级教师","助理实验师","助理馆员","副编审(主任编辑","工程师","教授（思政）","实验员","null","副主任护师","会计员","编辑","园艺师","实验师","高级审计师","中级","讲师","编审","助教","助理会计师","高级经济师","医师","员级","见习","药师","助理讲师","其他初级","","药士","高级实验师","研究员","助理工程师","助理工艺美术师","教授级高工","主治医师","审计师","辅导员","副总经理","思政助教","经济员","助讲","主管药师","二级教师","助理工程","助理经济师","中学二级教师","研究员(教育管理)","科员","副高级","护士","中教一级","一级教师","幼儿一级教师","八级职员","副主任医师","教授","会计师","管理员","主管技师","其他中级","其他副高级","助理研究员","政工员","主管护师","中级工","幼儿高级教师","高级工程师","研究馆员（图书）","助会","高级工程","助理审计师","十级","研究员（社会科学）","教授（高校）","思政副教授","经济师","其他正高级","高校教师","小学一级教师","技士"]
s = ''
for i in range(len(zc)):
    s += str(i) + ':' + zc[i]+', '
print(s)


